# date : 20240129
# desc : 변수설명

# 변수(Variable) - 변하는 수. 파이썬에는 들어가는 종류나 크기에 제약이 없음.
var01 = 10
print(var01)

var02 = 1000000000000000000000000000000000000000000000000000000000000
print(var02)

var03 = 9999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999
print(var03)

var04 = False
print(False)

var05 = 'Life is short, You need Python.'
print(var05)

# 단, 변수명 지정 시에
## - 숫자로 시작하거나
## - 공백이 있거나
## _(언더바) 이외의 특수문자가 있으면 안된다.
## _로 시작하는 변수는 되도록 사용 X
